{
  "posts": "[\"I think of grading as the way I pay, in suffering, for my otherwise lucky life.\",\"Grading is one of the major reasons I quit tenure. I hated it and didn't believe it was worthwhile.\",\"He interviewed 300 high achievers about their morning routines. Here's what they had in common.\",\"the more I do functional programming, the more I realize that functions are bad actually and that we all need to write way more datatypes\",\"sorry\\n\\nI wrote a reply, and went to check my working, fell into a rabbit-hole:\\n• https://www.reddit.com/r/compsci/comments/av9juw/computing_with_trees_not_numbers_is_tree_calculus/ …\\n• http://lambda-the-ultimate.org/node/3993 \\n• https://web.archive.org/web/20120322182005/http://www-staff.it.uts.edu.au/~cbj/Publications/factorisation.pdf …\\n\\nI *thought* it allowed destructuring of functions (unlike LC), but now I'm not sure if it's just regarding *arguments*.\",\"(What I'm saying is that i think i nerd-sniped myself; my apologies for the randoing-into-thread joke all the same.)\",\"wait discovery is on cbs in the usa? i honestly thought it was a netflix funded show!\",\"knowing that fp-ts is in the RWC test suite is a warm feelingpic.twitter.com/P4RTi0GsWy\",\"Boy do I wanna go to this\\n(but go take my place)https://twitter.com/j_v_66/status/1102936559563796481 …\",\"fatal to the last degree of fatality; those repeated disastrous repulses, all accumulating and piling their terrors upon Moby Dick\",\"according to my calculations \\n  ━━━━━ ━━\\n┃  This is not    ┃\\n┃  Newsworthy ┃\\n┃  @thehill         ┃\\n└━━━━━━  ┘\\n 7 ┃ 8┃  9┃  / ┃\\n━┛━┛━. |━  ┛\\n4  ┃5 ┃6  ┃ + ┃\\n━┛━┛━┛━ ┛\\n1  ┃ 2 ┃ 3 ┃ = ┃\\n━┛━┛━┛━ ┛https://twitter.com/thehill/status/1102682150099447813 …\",\"You know what's good? A Kit Kat break. You know when you should have one? Now. #BreaksAreGood #HaveAKitKatpic.twitter.com/Yxx5rn48jm\",\"Look what I’ve got here! A Database Internals book. Just imagine that it’s a bass. Data bass.pic.twitter.com/tBjr704sFj\",\"Huh?https://twitter.com/speechboy71/status/1103431686191226880 …\",\"Trump just called Apple CEO Tim Cook “Tim Apple”pic.twitter.com/gTHHtjWvc9\",\"Technologies from @torproject trickle-down to being standard features:\\n\\n\\\"Firefox to add Tor Browser anti-fingerprinting technique called letterboxing\\\"https://www.zdnet.com/article/firefox-to-add-tor-browser-anti-fingerprinting-technique-called-letterboxing/ …\",\"\\\"La escuela pública tiene que recibir a todos y a todas las chicas, sin restricción. Esta obligación debería extenderse a las escuelas de gestión privada que tienen subvención total\\\". @CheMendele ahora en @lanacionmas\",\"Do we have a hooks version of this yet?https://twitter.com/dan_abramov/status/981712092611989509 …\",\"Haskell’s hard for people to learn and understand because we’ve built a Byzantine hell maze on top of a moving target compiler, not because of any innate mandatory complexity. Concept album ass language\",\"Le respondí a un antiderechos que mintió sobre nuestra ley y su incumplimiento en Tucumán, en inglés, a @guardian. \\nEstoy esperando para silenciar cuentas de enfermos fanáticos y trolls a la 1, a las 2...\",\"Looking good has never been easier. Tell us what you like and we’ll send pieces that suit you. Consider your shopping done.\",\"You may notice a higher-than-usual number hot/bad takes on things, because I legally can't talk about the thing that is happening that is breaking my heart.\",\"desperate afternoon espresso to keep yourself awake = despresso\",\"Cheap data declarations is an underappreciated killer feature of Haskell and the MLs.\",\"Lol you still live with your parents dude? Move in with me man we got a sweet 2 bedroom off the subway line with 8 roommates that used to all be friends but now hate each other and we all gave each other communicable mental illness\",\"I guess I’ve reached a follower count where Twitter’s faults as a platform begin to show. I no longer get all my notifications. And because I’m not verified (cough, cough @twitter) I don’t always see when you comment or interact. If I don’t respond, that’s why. pic.twitter.com/IZn3DZERFj\",\"I LOVE hearing from you and I’ll do my best to try and track down everyone’s comments. \\n\\nIf I miss you for some reason, it’s not you. It’s not me. It’s Twitter.pic.twitter.com/P3dLRr53RU\",\"looks like even with 32GB of RAM, LLVM builds still run out of memory...\",\"have you tried rewriting it in rust\",\"Designed for you, designed for winners. #VictoryInACanpic.twitter.com/2cuY9C54jG\",\"Two of my senior colleagues just came striding out of the elevator. One, seeing me, shouted to the other, “Here’s the man who’s going to settle it for us!” And then, to me: “Is existence a predicate?”\",\"I hate listicleshttps://twitter.com/nbcsandiego/status/1103445059498852353 …\",\"what a picture . ......And There you have it.....Amerikkkahttps://twitter.com/IronStache/status/1101933830179557380 …\",\"the Queer Council decided that all bisexuals have to own a leather jacket\",\"I wonder if a saint ever answers a prayer for intercession by appealing for the intercession of a more powerful saint, or: why does the Blessed Virgin, the most powerful saint, not simply eat the other saints?\",\"En este nuevo vídeo presentamos la noción de EQUIVALENCIA HOMOTÓPICA, que nos proporciona unas nuevas gafas  con las que mirar los espacios topológicos cuando queramos saber si tienen la MISMA FORMA .\\nPincha sobre la foto o el enlace https://youtu.be/CfFTnXzhyvs \",\"You work hard for your money. So why do you trust it to a two-star bank?pic.twitter.com/Fc4SxyaGCk\",\"Using beta-reduction, this:\\n\\n(λy. λx. x+y)(a)\\n\\nIs reduced (and is therefore equivalent) to:\\n\\nλx. x+a\\n\\nYou can argue that these two things not being equivalent in Python is \\\"normal\\\", but then you'll have to concede that python's \\\"lambda\\\" is either broken, or not a lambda at all.https://twitter.com/C_Papazian/status/1102835284218122246 …\",\"the more I do functional programming, the more I realize that functions are bad actually and that we all need to write way more datatypes\",\"Everything is encoded as a GADT in the initial encoding. I don’t know if this helps the general case that you want, but I’m literally pattern matching on data structures that map to functions representing the same semantics.\",\"Okay, so that's not pattern matching on a function, but that *is* doing what I think is preferable to functions!\",\"…the “pipeline problem”… a favorite among technology founders & business leaders, who like to believe that the cause of the massive gender imbalances in their workplaces lies far away from their own executive suites, in classrooms, rather than their own workplaces or culture…https://twitter.com/bfeld/status/1103458750076198916 …\",\"What people actually mean when they say they want “non-political” comics like when they were kids is that they’re devastated to have woken up one day as an adult, read a comic book, and realized they’d grown up to become the kind of person their childhood hero punches in the face\",\"Hey @TalentiGelato, big fan. How do I get on this train to awesometown?https://twitter.com/thekitchenista/status/1103309994215251968 …\",\"La señora de Confetti cada vez tarda más en empezar el pendejo juego. Al rato hasta ganas de sacar su stand up va a querer porque cree que sí es graciosa, ptm.\",\"I thought a bunch of reverse engineers had gotten sick from drinking contaminated water, but no, the NSA open sourced a tool\",\"New! ZzzQuil PURE Zzzs, a drug –free sleep-aid made with a unique blend of melatonin and botanicals. Most importantly, it really works.pic.twitter.com/3e9xaEkEkJ\",\"Hiring evening contract instructors for Web, iOS, Data Science, UX, and CS. 2x/wk 6-9PM PST or CST.\\n\\nWeb: https://jobs.lever.co/lambdaschool/503c0dd7-934a-4ace-bfdb-c8fc99cff988 …\\niOS: https://jobs.lever.co/lambdaschool/15be1ba0-9562-409e-849f-0fa60e1a1cdd …\\nDS: https://jobs.lever.co/lambdaschool/32e56dd1-ff8f-438b-9214-5707752ebeba …\\nUX: https://jobs.lever.co/lambdaschool/e39360da-457c-4aa5-a94e-45b272279ebf …\\nCS: https://jobs.lever.co/lambdaschool/b0daf2df-ddfd-4591-b2a3-10e13e8c67ad …\\n\\nActively seeking diverse candidates.\",\"Tony put the stake recipe back in the Departures Magazine\",\"¿Quién hizo esto? Yo solo soy una indefensa provinciana en esta ciudad.pic.twitter.com/6QD9jQ2cwg\",\"for the past 20 years whenever my mom asks what im doing on the weekend i say “sucking balls”\",\"the more I do functional programming, the more I realize that functions are bad actually and that we all need to write way more datatypes\",\"you can't pattern match on a function\",\"Every Lisper in the world just looked at the camera.\",\"\\\"Do not ask for whom Susan tolls\\nshe tolls for thee.\\\"https://twitter.com/OnlineXtians/status/1101299012160929793 …\",\"Current status: using procrastination from an urgent matter to finally push through long-standing procrastination from a previously urgent matter.\",\"“In the photograph, I see three women, even though only one is visible: Eve, Marilyn, and Molly Bloom. Together, half-way home ...” \\n\\nI loved this.https://www.affidavit.art/articles/marilyn-monroe …\",\"I will never forget a time I forgot to mute myself during standup - I was heard saying \\\"WHO'S A GOOD BOY?? *YOU'RE* A GOOOOD BOYYY\\\" while the in-office team just watched my headshot grin at them from the massive screen. It went on for more than a full minute.\",\"@jevakallio was like “I AMMMMMMM”\",\".@zackfox flexes his production skills as he shares funk-filled flip of @1GunnaGunna's \\\"Space Cadet\\\".  https://lvtr.co/2VGkGOO pic.twitter.com/2PY5K2JFjb\",\"What is happening to my life right nowpic.twitter.com/LO4mB8SVsq\",\"In fairness I had a dank strip steak for lunch\",\"just wanna say that i would donate to a Awesome GUIs Downed Quickly twitch streamhttps://twitter.com/Foone/status/1103384684812255233 …\",\"Kiki and Jellybean. They are the perfect animalspic.twitter.com/nFWf3eI0LH\",\"my roommate started vaping to quit smoking but now he vapes too much so he's started smoking again to quit vaping. incredible\",\"Infertility is terrible, but abortion is not a zero-sum proposition. \\nAnother person's abortion has no impact on your own ability to conceive a child. \\nThe birth of an unwanted child does not ensure that a wanted child is born.\\nNo one is burning babies alive.https://twitter.com/StephCher55/status/1102641652483715073 …\",\"Drive through the season with the 2019 Jeep Cherokee.\",\"Correct software could be efficient...https://twitter.com/Sydonahi/status/1102113608497020929 …\",\"Getting a degree is a privilege but also operating successfully without contemplating getting a degree is one as wellhttps://twitter.com/joannecheng/status/1102690296721223680 …\",\" Our conference schedule is now online!\\n\\nWe are really happy with the final results and are looking forward to an awesome conference day with even more awesome speakers!\\n\\nCheck it out: https://www.reason-conf.com/schedule/ \\n\\nPS: Did you know that @marcelcutts will be our wonderful MC? \",\"Hello there.pic.twitter.com/UppuTNboEq\",\"Normal adult asking a normal adult question:\\n\\nHow do y'all do jobs, then all the life admin things you need to do and not wind up perpetually worn out?\\n\\nAsking for a friend.\",\"“Simplicity drives value. But we must measure value. If we don’t measure, it’s the tree falling in the forest. Nobody in the organization realizes the value of our work.” @gerrymcgovern #AEASEA #ux\",\"We need to figure out what's not working and take it away. Don't just stick a band-aid on it. @gerrymcgovern #AEASEA\",\"Great thread on the rise of the Southern Strategy from @eh_miller:https://twitter.com/eh_miller/status/1103364338071539712 …\",\"This jet fuel not only has 80% fewer emissions than traditional transportation fuels, it reduces landfill waste.\",\"all 6 of my brain cells assembling so I can spell necessarypic.twitter.com/EmiAV5OMV6\",\"why can't you just give all the cat food you have to the cats and they can decide for themselveshttps://twitter.com/jbendery/status/1103302380874027008 …\",\"send tweet\",\"If it weren't for racism and misogyny, we'd view Marie Kondo the way we view Mister Rogers and Bob Ross.\",\"paw programmingpic.twitter.com/2zJTrJqMlP\",\"UNPEELED SHRIMP WAS A FUCKING MISTAKE\"]"
}
